In [2]:
import pandas as pd

Dataset from https://www.kaggle.com/datasets/lukebarousse/data-analyst-job-postings-google-search/code

In [3]:
df = pd.read_csv('gsearch_jobs.csv')

In [4]:
df.shape

(22853, 27)

In [5]:
df.head()

,Unnamed: 0,index,title,company_name,location,via,description,extensions,job_id,thumbnail,...,commute_time,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst - HR Analytics (H),Avispa,United States,via LinkedIn,Data Analyst - HR Analytics R-2023-05-112 (H)\...,"['21 hours ago', 'Full-time', 'Health insuranc...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBIUiBBbm...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'tableau', 'sql', 'python']"
1,1,1,Data Analyst/Scientist,World Wide Technology,Anywhere,via LinkedIn,Company Overview:\n\nWorld Wide Technology (WW...,"['8 hours ago', 'Work from home', 'Contractor']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QvU2NpZW50aX...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['sql', 'ssis', 'aws']"
2,2,2,Data Analyst II,Corporate,"Jefferson City, MO",via JobServe,You could be the one who changes everything fo...,"['6 hours ago', 'Full-time', 'Health insurance...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgSUkiLCJodG...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'sql', 'ssis', 'ssrs']"
3,3,3,Data analyst,Upwork,Anywhere,via Upwork,Want a good data analyst who can handle large ...,"['15 hours ago', '15–45 an hour', 'Work from h...",eyJqb2JfdGl0bGUiOiJEYXRhIGFuYWx5c3QiLCJodGlkb2...,NaN,...,NaN,15–45,an hour,30.0,15.0,45.0,30.0,NaN,62400.0,[]
4,4,4,Data Analyst – Global Learning Management,Kelly Services,"Wichita, KS",via MyKelly,"At Kelly® Professional & Industrial, we’re pas...",['12 hours ago'],eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3Qg4oCTIEdsb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['tableau']

In [6]:
df.describe()

,Unnamed: 0,index,commute_time,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized
count,22853.000000,22853.000000,0.0,4332.000000,4064.000000,4064.000000,2612.000000,1713.000000,4332.000000
mean,11426.000000,1137.280882,NaN,40000.934539,33780.174405,47855.897852,44.509788,101065.236929,95905.148213
std,6597.237187,742.799016,NaN,52546.256475,44122.891275,62439.754512,23.049654,28521.952993,41539.234564
min,0.000000,0.000000,NaN,9.000000,8.000000,10.000000,9.000000,29289.840000,18720.000000
25%,5713.000000,519.000000,NaN,33.000000,20.000000,45.000000,29.375000,85000.000000,65000.000000
50%,11426.000000,1079.000000,NaN,62.500000,50.000000,75.000000,40.000000,96500.000000,96500.000000
75%,17139.000000,1650.000000,NaN,96500.000000,77000.000000,115000.000000,57.500000,110500.000000,119600.000000
max,22852.000000,3476.000000,NaN,233500.000000,215000.000000,283000.000000,300.000000,233500.000000,624000.000000

In [7]:
df.dtypes

Unnamed: 0               int64
index                    int64
title                   object
company_name            object
location                object
via                     object
description             object
extensions              object
job_id                  object
thumbnail               object
posted_at               object
schedule_type           object
work_from_home          object
salary                  object
search_term             object
date_time               object
search_location         object
commute_time           float64
salary_pay              object
salary_rate             object
salary_avg             float64
salary_min             float64
salary_max             float64
salary_hourly          float64
salary_yearly          float64
salary_standardized    float64
description_tokens      object
dtype: object

# Data Integrity Check

In [8]:
df.isnull().sum()

Unnamed: 0                 0
index                      0
title                      0
company_name               0
location                  19
via                        0
description                0
extensions                 0
job_id                     0
thumbnail              11057
posted_at                  0
schedule_type            157
work_from_home         12610
salary                 18521
search_term                0
date_time                  0
search_location            0
commute_time           22853
salary_pay             18521
salary_rate            18521
salary_avg             18521
salary_min             18789
salary_max             18789
salary_hourly          20241
salary_yearly          21140
salary_standardized    18521
description_tokens         0
dtype: int64

In [13]:
df.duplicated().sum()

0

# Removing Unwanted Columns

In [14]:
df = df.drop(['job_id', 'thumbnail', 'commute_time'], axis=1)

In [15]:
df

,Unnamed: 0,index,title,company_name,location,via,description,extensions,posted_at,schedule_type,...,search_location,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst - HR Analytics (H),Avispa,United States,via LinkedIn,Data Analyst - HR Analytics R-2023-05-112 (H)\...,"['21 hours ago', 'Full-time', 'Health insuranc...",21 hours ago,Full-time,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'tableau', 'sql', 'python']"
1,1,1,Data Analyst/Scientist,World Wide Technology,Anywhere,via LinkedIn,Company Overview:\n\nWorld Wide Technology (WW...,"['8 hours ago', 'Work from home', 'Contractor']",8 hours ago,Contractor,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['sql', 'ssis', 'aws']"
2,2,2,Data Analyst II,Corporate,"Jefferson City, MO",via JobServe,You could be the one who changes everything fo...,"['6 hours ago', 'Full-time', 'Health insurance...",6 hours ago,Full-time,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'sql', 'ssis', 'ssrs']"
3,3,3,Data analyst,Upwork,Anywhere,via Upwork,Want a good data analyst who can handle large ...,"['15 hours ago', '15–45 an hour', 'Work from h...",15 hours ago,Contractor,...,United States,15–45,an hour,30.0,15.0,45.0,30.0,NaN,62400.0,[]
4,4,4,Data Analyst – Global Learning Management,Kelly Services,"Wichita, KS",via MyKelly,"At Kelly® Professional & Industrial, we’re pas...",['12 hours ago'],12 hours ago,NaN,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['tableau']
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
22848,22848,627,Marketing Data & BI Analyst II,EDWARD JONES,"Houstonia, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '76,798–130,764 a year', 'Ful...",23 hours ago,Full-time,...,United States,76798–130764,a year,103781.0,76798.0,130764.0,NaN,103781.0,103781.0,"['python', 'r', 'power_bi', 'excel', 'tableau'..."
22849,22849,628,Lead-Data Analyst,EDWARD JONES,"Marshfield, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",23 hours ago,Full-time,...,United States,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
22850,22850,629,Lead-Data Analyst,EDWARD JONES,"High Point, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",23 hours ago,Full-time,...,United States,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
22851,22851,630,Lead-Data Analyst,EDWARD JONES,"Calhoun, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",23 hours ago,Full-time,...,United States,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
22852,22852,631,Institutional Credit Management - Lending Data...,Citi,United States,via My ArkLaMiss Jobs,The Institutional Credit Management (ICM) grou...,"['24 hours ago', '105,850–158,780 a year', 'Fu...",24 hours ago,Full-time,...,United States,105850–158780,a year,132315.0,105850.0,158780.0,NaN,132315.0,132315.0,"['tableau', 'cognos']"

In [18]:
df.to_csv('gsearch_jobs.csv', index=False)

In [4]:
df.shape

(22853, 24)

In [5]:
df.head()

,Unnamed: 0,index,title,company_name,location,via,description,extensions,posted_at,schedule_type,...,search_location,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst - HR Analytics (H),Avispa,United States,via LinkedIn,Data Analyst - HR Analytics R-2023-05-112 (H)\...,"['21 hours ago', 'Full-time', 'Health insuranc...",21 hours ago,Full-time,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'tableau', 'sql', 'python']"
1,1,1,Data Analyst/Scientist,World Wide Technology,Anywhere,via LinkedIn,Company Overview:\n\nWorld Wide Technology (WW...,"['8 hours ago', 'Work from home', 'Contractor']",8 hours ago,Contractor,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['sql', 'ssis', 'aws']"
2,2,2,Data Analyst II,Corporate,"Jefferson City, MO",via JobServe,You could be the one who changes everything fo...,"['6 hours ago', 'Full-time', 'Health insurance...",6 hours ago,Full-time,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'sql', 'ssis', 'ssrs']"
3,3,3,Data analyst,Upwork,Anywhere,via Upwork,Want a good data analyst who can handle large ...,"['15 hours ago', '15–45 an hour', 'Work from h...",15 hours ago,Contractor,...,United States,15–45,an hour,30.0,15.0,45.0,30.0,NaN,62400.0,[]
4,4,4,Data Analyst – Global Learning Management,Kelly Services,"Wichita, KS",via MyKelly,"At Kelly® Professional & Industrial, we’re pas...",['12 hours ago'],12 hours ago,NaN,...,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['tableau']

In [8]:
df.dtypes

Unnamed: 0               int64
index                    int64
title                   object
company_name            object
location                object
via                     object
description             object
extensions              object
posted_at               object
schedule_type           object
work_from_home          object
salary                  object
search_term             object
date_time               object
search_location         object
salary_pay              object
salary_rate             object
salary_avg             float64
salary_min             float64
salary_max             float64
salary_hourly          float64
salary_yearly          float64
salary_standardized    float64
description_tokens      object
dtype: object

In [10]:
df.isnull().sum()

Unnamed: 0                 0
index                      0
title                      0
company_name               0
location                  19
via                        0
description                0
extensions                 0
posted_at                  0
schedule_type            157
work_from_home         12610
salary                 18521
search_term                0
date_time                  0
search_location            0
salary_pay             18521
salary_rate            18521
salary_avg             18521
salary_min             18789
salary_max             18789
salary_hourly          20241
salary_yearly          21140
salary_standardized    18521
description_tokens         0
dtype: int64

In [11]:
df['index'].nunique()

3477

In [12]:
df['title'].nunique()

8873

In [13]:
df['company_name'].nunique()

5918

In [14]:
df.describe()

,Unnamed: 0,index,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized
count,22853.000000,22853.000000,4332.000000,4064.000000,4064.000000,2612.000000,1713.000000,4332.000000
mean,11426.000000,1137.280882,40000.934539,33780.174405,47855.897852,44.509788,101065.236929,95905.148213
std,6597.237187,742.799016,52546.256475,44122.891275,62439.754512,23.049654,28521.952993,41539.234564
min,0.000000,0.000000,9.000000,8.000000,10.000000,9.000000,29289.840000,18720.000000
25%,5713.000000,519.000000,33.000000,20.000000,45.000000,29.375000,85000.000000,65000.000000
50%,11426.000000,1079.000000,62.500000,50.000000,75.000000,40.000000,96500.000000,96500.000000
75%,17139.000000,1650.000000,96500.000000,77000.000000,115000.000000,57.500000,110500.000000,119600.000000
max,22852.000000,3476.000000,233500.000000,215000.000000,283000.000000,300.000000,233500.000000,624000.000000

In [15]:
df['description'][0]

'Data Analyst - HR Analytics R-2023-05-112 (H)\n\nA leading music streaming company is seeking a Data Analyst - HR Analytics. The successful candidate will deliver meaningful analysis, identify and communicate trends, and key insights, quality control audits of automated metrics, assist with ad-hoc analysis, and assist with maintenance of the People Analytics data warehouse. The ideal candidate has... experience with people data, engages with various teams to understand problem statements, and works independently to take end-to-end ownership of analytics assignments.\n\nData Analyst - HR Analytics Pay And Benefits\n• Hourly pay: $60/hr\n• Worksite: Leading streaming company (Remote, Candidates located on the East Coast/ET time zone are preferred)\n• W2 Employment, Group Medical, Dental, Vision, Life, Retirement Savings Program\n• 40 hours/week, 6 Month Assignment\n\nData Analyst - HR Analytics Responsibilities\n• Collaborate with various internal workstreams and leadership to prepare, analyze, and distribute data to drive process insights and improvements.\n• Deliver descriptive summaries, reports, insights, as required.\n• Develop, test and validate dashboards for various business partners and leaders.\n• Perform quality control and audits of people programs.\n• Run data audits and research and resolve reporting/data entry discrepancies\n• Assist with data updates by populating import templates.\n• Help ensure consistency around data hierarchy, and definitions, and maintain consistent and accurate data in our systems including historical data\n• Maintain security and safeguard confidential information\n• Document and implement data workflows, process maps, etc. as required\n• Assist with compliance-related reporting\n• Perform other duties as assigned\n• Assist in gathering and documenting requirements from the People + Culture functional leaders and providing both ongoing and ad-hoc data analysis.\n\nData Analyst - HR Analytics Qualifications\n• 3+ years of experience in advanced analytics.\n• Bachelor’s degree or equivalent combination of education and experience.\n• Experience with Workday and Workday Reporting.\n• Experience with HRIS & Applicant Tracking Systems (ATS) is preferred.\n• Experience with relational databases, SQL, Python preferred.\n• Advanced Microsoft Excel Skills.\n• Familiarity with building data visualizations hosted on web-based platforms such as Tableau is preferred.\n• Curious problem solver with an ability to answer questions and tell a story using data.\n• Ability to work with large data sets and summarize key findings.\n• Keen attention to detail and passion for data and data integrity, process, and efficiency.\n• Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.\n• Strong organizational skills and attention to details.\n• Discretion and sensitivity to confidentiality.\n• Willingness to take initiative and ownership of projects.\n• Positive attitude and strong work ethic'

In [16]:
df['description_tokens'][0]

"['excel', 'tableau', 'sql', 'python']"